RobFro96/MSP430-NRF24-WSN/firmware/msp430-spirit1-sensornode/_spirit1/spirit_regs.h
/** @defgroup FIFO_CONFIG3_Register
 * @{
 */

/**
 *  \brief FIFO_CONFIG3  registers
 *  \code
 *   Default value: 0x30
 *   Read Write
 *   7    Reserved.
 *
 *   6:0  rxafthr [6:0]: FIFO Almost Full threshold for rx fifo.
 *
 *   \endcode
 */
#define	FIFO_CONFIG3_RXAFTHR_BASE				((uint8_t)0x3E) /*!< FIFO Almost Full threshold for rx fifo [6:0] */

/**
 * @}
 */

/** @defgroup FIFO_CONFIG2_Register
 * @{
 */

/**
 *  \brief FIFO_CONFIG2  registers
 *  \code
 *   Default value: 0x30
 *   Read Write
 *   7    Reserved.
 *
 *   6:0  rxaethr [6:0]: FIFO Almost Empty threshold for rx fifo.
 *
 *   \endcode
 */
#define	FIFO_CONFIG2_RXAETHR_BASE				((uint8_t)0x3F) /*!< FIFO Almost Empty threshold for rx fifo [6:0] */

/**
 * @}
 */

/** @defgroup FIFO_CONFIG1_Register
 * @{
 */

/**
 *  \brief FIFO_CONFIG1  registers
 *  \code
 *   Default value: 0x30
 *   Read Write
 *   7    Reserved.
 *
 *   6:0  txafthr [6:0]: FIFO Almost Full threshold for tx fifo.
 *
 *   \endcode
 */
#define	FIFO_CONFIG1_TXAFTHR_BASE				((uint8_t)0x40) /*!< FIFO Almost Full threshold for tx fifo [6:0] */

/**
 * @}
 */

/** @defgroup FIFO_CONFIG0_Register
 * @{
 */

/**
 *  \brief FIFO_CONFIG0  registers
 *  \code
 *   Default value: 0x30
 *   Read Write
 *   7    Reserved.
 *
 *   6:0  txaethr [6:0]: FIFO Almost Empty threshold for tx fifo.
 *
 *   \endcode
 */
#define	FIFO_CONFIG0_TXAETHR_BASE				((uint8_t)0x41) /*!< FIFO Almost Empty threshold for tx fifo [6:0] */

/**
 * @}
 */

/** @defgroup LINEAR_FIFO_STATUS1_Register
 * @{
 */

/**
 *  \brief LINEAR_FIFO_STATUS1  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7     Reserved.
 *
 *   6:0   elem_txfifo[6:0]:     Number of elements in the linear TXFIFO (<=96)
 *   \endcode
 */
#define	LINEAR_FIFO_STATUS1_BASE				((uint8_t)(0xE6)) /*!< Number of elements in the linear TX FIFO [6:0] (<=96) */

/**
 * @}
 */

/** @defgroup LINEAR_FIFO_STATUS0_Register
 * @{
 */

/**
 *  \brief LINEAR_FIFO_STATUS0  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7     Reserved.
 *
 *   6:0   elem_rxfifo[6:0]:     Number of elements in the linear RXFIFO (<=96)
 *   \endcode
 */
#define	LINEAR_FIFO_STATUS0_BASE				((uint8_t)(0xE7)) /*!< Number of elements in the linear RX FIFO [6:0] (<=96) */

/**
 * @}
 */

/**
 * @}
 */

/** @defgroup Calibration_Registers
 * @{
 */

/** @defgroup RCO_VCO_CALIBR_IN2_Register
 * @{
 */

/**
 *  \brief RCO_VCO_CALIBR_IN2  registers
 *  \code
 *   Default value: 0x70
 *   Read Write
 *   7:4     RWT_IN[3:0]: RaWThermometric word value for the RCO [7:4]
 *
 *   3:0     RFB_IN[4:1]: ResistorFineBit word value for the RCO (first 4 bits)
 *   \endcode
 */
#define	RCO_VCO_CALIBR_IN2_BASE					((uint8_t)0x6D) /*!< RaWThermometric word value for the RCO [7:4]; ResistorFineBit word value for the RCO [3:0] */

/**
 * @}
 */

/** @defgroup RCO_VCO_CALIBR_IN1_Register
 * @{
 */

/**
 *  \brief RCO_VCO_CALIBR_IN1  registers
 *  \code
 *   Default value: 0x48
 *   Read Write
 *
 *   7     RFB_IN[0]: ResistorFineBit word value for the RCO (LSb)
 *
 *   6:0   VCO_CALIBR_TX[6:0]:  Word value for the VCO to be used in TX mode
 *   \endcode
 */
#define	RCO_VCO_CALIBR_IN1_BASE					((uint8_t)0x6E) /*!< ResistorFineBit word value for the RCO [7]; Word value for the VCO to be used in TX mode  [6:0]*/

/**
 * @}
 */

/** @defgroup RCO_VCO_CALIBR_IN0_Register
 * @{
 */

/**
 *  \brief RCO_VCO_CALIBR_IN0  registers
 *  \code
 *   Default value: 0x48
 *   Read Write
 *
 *   7     Reserved.
 *
 *   6:0   VCO_CALIBR_RX[6:0]:  Word value for the VCO to be used in RX mode
 *   \endcode
 */
#define	RCO_VCO_CALIBR_IN0_BASE					((uint8_t)0x6F) /*!< Word value for the VCO to be used in RX mode [6:0] */

/**
 * @}
 */

/** @defgroup RCO_VCO_CALIBR_OUT1_Register
 * @{
 */

/**
 *  \brief RCO_VCO_CALIBR_OUT1  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:4   RWT_OUT[3:0]:    RWT word from internal RCO calibrator
 *
 *   3:0   RFB_OUT[4:1]:     RFB word from internal RCO calibrator (upper part)
 *   \endcode
 */
#define	RCO_VCO_CALIBR_OUT1_BASE				((uint8_t)(0xE4)) /*!< RaWThermometric RWT word from internal RCO calibrator [7];
                                                                                       ResistorFineBit RFB word from internal RCO oscillator [6:0] */
/**
 * @}
 */

/** @defgroup RCO_VCO_CALIBR_OUT0_Register
 * @{
 */

/**
 *  \brief RCO_VCO_CALIBR_OUT0  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7     RFB_OUT[0]:    RFB word from internal RCO calibrator (last bit LSB)
 *
 *   6:0   VCO_CALIBR_DATA[6:0]:     Output word from internal VCO calibrator
 *   \endcode
 */
#define	RCO_VCO_CALIBR_OUT0_BASE				((uint8_t)(0xE5)) /*!< ResistorFineBit RFB word from internal RCO oscillator [0];
                                                                                       Output word from internal calibrator [6:0]; */
/**
 * @}
 */

/**
 * @}
 */

/** @defgroup AES_Registers
 * @{
 */

/** @defgroup AES_KEY_IN_Register
 * @{
 */

/**
 *  \brief AES_KEY_INx  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *
 *   7:0   AES_KEY_INx[7:0]:  AES engine key input (total - 128 bits)
 *   \endcode
 */
#define	AES_KEY_IN_15_BASE					((uint8_t)0x70) /*!< AES engine key input 15 */

#define	AES_KEY_IN_14_BASE					((uint8_t)0x71) /*!< AES engine key input 14 */

#define	AES_KEY_IN_13_BASE					((uint8_t)0x72) /*!< AES engine key input 13 */

#define	AES_KEY_IN_12_BASE					((uint8_t)0x73) /*!< AES engine key input 12 */

#define	AES_KEY_IN_11_BASE					((uint8_t)0x74) /*!< AES engine key input 11 */

#define	AES_KEY_IN_10_BASE					((uint8_t)0x75) /*!< AES engine key input 10 */

#define	AES_KEY_IN_9_BASE					((uint8_t)0x76) /*!< AES engine key input 9 */

#define	AES_KEY_IN_8_BASE					((uint8_t)0x77) /*!< AES engine key input 8 */

#define	AES_KEY_IN_7_BASE					((uint8_t)0x78) /*!< AES engine key input 7 */

#define	AES_KEY_IN_6_BASE					((uint8_t)0x79) /*!< AES engine key input 6 */

#define	AES_KEY_IN_5_BASE					((uint8_t)0x7A) /*!< AES engine key input 5 */

#define	AES_KEY_IN_4_BASE					((uint8_t)0x7B) /*!< AES engine key input 4 */

