RobFro96/MSP430-NRF24-WSN/firmware/msp430-spirit1-sensornode/_spirit1/spirit_regs.h
#define IRQ_STATUS1_TX_FIFO_ALMOST_EMPTY			((uint8_t)0x01) /*!< IRQ: TX FIFO almost empty */
#define IRQ_STATUS1_RX_FIFO_ALMOST_FULL				((uint8_t)0x02) /*!< IRQ: RX FIFO almost full */
#define IRQ_STATUS1_RX_FIFO_ALMOST_EMPTY			((uint8_t)0x04) /*!< IRQ: RX FIFO almost empty */
#define IRQ_STATUS1_MAX_BO_CCA_REACH				((uint8_t)0x08) /*!< IRQ: Max number of back-off during CCA */
#define IRQ_STATUS1_VALID_PREAMBLE				((uint8_t)0x10) /*!< IRQ: Valid preamble detected */
#define IRQ_STATUS1_VALID_SYNC					((uint8_t)0x20) /*!< IRQ: Sync word detected */
#define IRQ_STATUS1_RSSI_ABOVE_TH				((uint8_t)(0x40)) /*!< IRQ: RSSI above threshold */
#define IRQ_STATUS1_WKUP_TOUT_LDC				((uint8_t)(0x80)) /*!< IRQ: Wake-up timeout in LDC mode */

/**
 * @}
 */

/** @defgroup IRQ_STATUS2_Register
 * @{
 */

/**
 *  \brief IRQ_STATUS2  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *
 *   7:0   INT_STATUS2:  IRQ status, if the correspondent bit is set and IRQ has been generated (according to the next table)
 *
 *            Bit |     Events Group Interrupt Event
 *           -------------------------------------------------------
 *            16  |       READY state in steady condition14
 *            17  |       STANDBY state switching in progress
 *            18  |       Low battery level
 *            19  |       Power-On reset
 *            20  |       Brown-Out event
 *            21  |       LOCK state in steady condition
 *            22  |       PM start-up timer expiration
 *            23  |       XO settling timeout
 *   \endcode
 */

#define IRQ_STATUS2_BASE					((uint8_t)0xFB) /*!< IRQ Events(RR, split into 4 registers) */

#define IRQ_STATUS2_READY					((uint8_t)(0x01)) /*!< IRQ: READY state in steady condition*/
#define IRQ_STATUS2_STANDBY_DELAYED				((uint8_t)(0x02)) /*!< IRQ: STANDBY state after MCU_CK_CONF_CLOCK_TAIL_X clock cycles */
#define IRQ_STATUS2_LOW_BATT_LVL				((uint8_t)(0x04)) /*!< IRQ: Battery level below threshold*/
#define IRQ_STATUS2_POR						((uint8_t)(0x08)) /*!< IRQ: Power On Reset */
#define IRQ_STATUS2_BOR						((uint8_t)(0x10)) /*!< IRQ: Brown out event (both accurate and inaccurate)*/
#define IRQ_STATUS2_LOCK					((uint8_t)(0x20)) /*!< IRQ: LOCK state in steady condition */
#define IRQ_STATUS2_PM_COUNT_EXPIRED				((uint8_t)(0x40)) /*!< IRQ: Power Management startup timer expiration (see reg PM_START_COUNTER, 0xB5) */
#define IRQ_STATUS2_XO_COUNT_EXPIRED				((uint8_t)(0x80)) /*!< IRQ: Crystal oscillator settling time counter expired */

/**
 * @}
 */

/** @defgroup IRQ_STATUS3_Register
 * @{
 */

/**
 *  \brief IRQ_STATUS3  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *
 *   7:0   INT_STATUS3:  IRQ status, if the correspondent bit is set and IRQ has been generated (according to the next table)
 *
 *            Bit |     Events Group Interrupt Event
 *           -------------------------------------------------------
 *            24  |       SYNTH locking timeout
 *            25  |       SYNTH calibration start-up time
 *            26  |       SYNTH calibration timeout
 *            27  |       TX circuitry start-up time
 *            28  |       RX circuitry start-up time
 *            29  |       RX operation timeout
 *            30  |       Others AES End�of �Operation
 *            31  |       Reserved
 *    \endcode
 */
#define IRQ_STATUS3_BASE					((uint8_t)0xFA) /*!< IRQ Events(RR, split into 4 registers) */

#define IRQ_STATUS3_SYNTH_LOCK_TIMEOUT				((uint8_t)(0x01)) /*!< IRQ: LOCK state timeout */
#define IRQ_STATUS3_SYNTH_LOCK_STARTUP				((uint8_t)(0x02)) /*!< IRQ: only for debug; see CALIBR_START_COUNTER */
#define IRQ_STATUS3_SYNTH_CAL_TIMEOUT				((uint8_t)(0x04)) /*!< IRQ: SYNTH locking timeout */
#define IRQ_STATUS3_TX_START_TIME				((uint8_t)(0x08)) /*!< IRQ: only for debug; TX circuitry startup time; see TX_START_COUNTER */
#define IRQ_STATUS3_RX_START_TIME				((uint8_t)(0x10)) /*!< IRQ: only for debug; RX circuitry startup time; see TX_START_COUNTER */
#define IRQ_STATUS3_RX_TIMEOUT					((uint8_t)(0x20)) /*!< IRQ: RX operation timeout expiration */
#define IRQ_STATUS3_AES_END					((uint8_t)(0x40)) /*!< IRQ: AES End of operation */

/**
 * @}
 */

/**
 * @}
 */

/** @defgroup MC_STATE_Registers
 * @{
 */

/** @defgroup MC_STATE1_Register
 * @{
 */

/**
 *  \brief MC_STATE1  registers
 *  \code
 *   Default value: 0x50
 *   Read
 *
 *   7:4     Reserved.
 *
 *   3       ANT_SELECT:  Currently selected antenna
 *
 *   2       TX_FIFO_Full:     1 - TX FIFO is full
 *
 *   1       RX_FIFO_Empty:    1 - RX FIFO is empty
 *
 *   0       ERROR_LOCK:       1 - RCO calibrator error
 *   \endcode
 */
#define	MC_STATE1_BASE						((uint8_t)(0xC0)) /*!< MC_STATE1 register address (see the SpiritStatus struct */

/**
 * @}
 */

/** @defgroup MC_STATE0_Register
 * @{
 */

/**
 *  \brief MC_STATE0  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:1     STATE[6:0]: Current MC state.
 *
 *      REGISTER VALUE |         STATE
 *   --------------------------------------------
 *            0x40     |         STANDBY
 *            0x36     |         SLEEP
 *            0x03     |         READY
 *            0x3B     |         PM setup
 *            0x23     |         XO settling
 *            0x53     |         SYNTH setup
 *            0x1F     |         PROTOCOL
 *            0x4F     |         SYNTH calibration
 *            0x0F     |         LOCK
 *            0x33     |         RX
 *            0x5F     |         TX
 *
 *   0       XO_ON:       1 - XO is operating
 *   \endcode
 */
#define	MC_STATE0_BASE						((uint8_t)(0xC1)) /*!< MC_STATE0 register address. In this version ALL existing states have been inserted
                                                                                       and are still to be verified */
/**
 * @}
 */

/**
 * @}
 */

/** @defgroup Engineering-Test_Registers
 * @{
 */

#define	SYNTH_CONFIG1_BASE					((uint8_t)(0x9E)) /*!< Synthesizier registers: M, A, K data sync on positive/negative clock edges [4],
                                                                                       Enable Linearization of the charge pump [3], split time 1.75/3.45ns [2], VCO calibration window 16,32,64,128 clock cycles [1:0]*/
#define	SYNTH_CONFIG0_BASE					((uint8_t)(0x9F)) /*!< Enable DSM randomizer [7], Window width 1.2-7.5ns (Down-up) of lock detector*/
#define	VCOTH_BASE						((uint8_t)(0xA0)) /*!< Controls the threshold frequency between VCO low and VCO high [7:0]
                                                                                       VCOth frequency=2*fXO*(96+VCO_TH/16), fmin=4992 MHz, fmax=5820 MHz*/
#define	PM_CONFIG2_BASE						((uint8_t)(0xA4)) /*!< Enables high current buffer on Temperature sensor, sets SMPS options */
#define	PM_CONFIG1_BASE						((uint8_t)(0xA5)) /*!< Set SMPS options */
#define	PM_CONFIG0_BASE						((uint8_t)(0xA6)) /*!< Set SMPS options */
#define	VCO_CONFIG_BASE						((uint8_t)(0xA1)) /*!< Set VCO current [5:2]part and [1:0] part */
#define	XO_CONFIG_BASE						((uint8_t)(0xA7)) /*!< Clock management options from XO to digital part */

